In [1]:
# -------------------------------------------------------------------
# 결측치 처리 - (1) 치환
# - seaborn 에서 제공하는 Titanic 데이터 사용
# -------------------------------------------------------------------

In [107]:
import pandas as pd
import seaborn as sns
import numpy as np

In [108]:
# 데이터 로딩 ---------------------------------------------------------
# load_dataset()
titanicDF=sns.load_dataset('titanic')

In [109]:
# 데이터 확인 ---------------------------------------------------------
titanicDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [110]:
# 실제 데이터 확인 ---------------------------------------------------------------
titanicDF.head()
# survived = alive
# embarked = embark_town
# sex = who 
# sibsp = alone

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [111]:
titanicDF=titanicDF.drop(['alive','embark_town','who','sibsp'],axis=1)

In [112]:
titanicDF

,survived,pclass,sex,age,parch,fare,embarked,class,adult_male,deck,alone
0,0,3,male,22.0,0,7.2500,S,Third,True,NaN,False
1,1,1,female,38.0,0,71.2833,C,First,False,C,False
2,1,3,female,26.0,0,7.9250,S,Third,False,NaN,True
3,1,1,female,35.0,0,53.1000,S,First,False,C,False
4,0,3,male,35.0,0,8.0500,S,Third,True,NaN,True
...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,13.0000,S,Second,True,NaN,True
887,1,1,female,19.0,0,30.0000,S,First,False,B,True
888,0,3,female,NaN,2,23.4500,S,Third,False,NaN,False
889,1,1,male,26.0,0,30.0000,C,First,True,C,True
890,0,3,male,32.0,0,7.7500,Q,Third,True,NaN,True

In [113]:
# 결측치 확인 ------------------------------------------------------------
titanicDF.isnull().sum()

survived        0
pclass          0
sex             0
age           177
parch           0
fare            0
embarked        2
class           0
adult_male      0
deck          688
alone           0
dtype: int64

In [114]:
# 결측치있는 열만 불러오기
# 비교연산자랑 함께 사용해서 결과가 True, False 반환
# 불린인덱싱(Boolean Indexing)
missingSR=titanicDF.isnull().sum()
type(missingSR)

pandas.core.series.Series

In [115]:
FILLTER=missingSR>0
MASK=missingSR>0

In [116]:
missingSR[missingSR>0]
# missingSR[FILLTER] , missingSR[MASK]

age         177
embarked      2
deck        688
dtype: int64

In [117]:
# 결측치가 존재하는 컬럼에 값을 치환해서 결측치 제거 --------------------------------------
# => fillna() 메서드 사용 
missingSR[MASK].index

Index(['age', 'embarked', 'deck'], dtype='object')

In [118]:
# age 컬럼 결측치 처리 ------------------------------------------------------------------
meanAge=titanicDF['age'].mean()

titanicDF['age'].fillna(meanAge)#,inplace=True)

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: age, Length: 891, dtype: float64

In [130]:
# fillna() => method 매개변수 'ffill, bfill'
titanicDF['age'].fillna(method='ffill')
titanicDF['age'].fillna(method='bfill')

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [133]:
titanicDF['age'].fillna(titanicDF.mode()['age'][0]) # 최빈값 mode 시리즈형태로 줘서 인덱스[0] 써야됨

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    24.0
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [123]:
# 실습 ===============================================================
# 나머지 변수도 판단하에 결측 처리
missingSR[missingSR>0]

age         177
embarked      2
deck        688
dtype: int64

In [ ]:
titanicDF['age'].fillna(meanAge,inplace=True)

In [127]:
titanicDF.embarked.value_counts()

S    644
C    168
Q     77
Name: embarked, dtype: int64

In [128]:
titanicDF.deck.value_counts()

C    59
B    47
D    33
E    32
A    15
F    13
G     4
Name: deck, dtype: int64

In [137]:
import matplotlib.pyplot as plt